trunk/src/SendMessToDeanComApp/test/loadMessageOfStation/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sen="SendMessToDeanComApp">
  <soapenv:Body>
    <sen:loadMessageOfStationOperation>
      <tableName>teacher</tableName>
      <state>ok</state>
    </sen:loadMessageOfStationOperation>
  </soapenv:Body>
</soapenv:Envelope>