trunk/src/SendMessToDeanComApp/test/SecretarySetState/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sen="SendMessToDeanComApp">
  <soapenv:Body>
    <sen:SecretarySetStateOperation>
      <id_>9</id_>
      <state_>ok</state_>
      <note_>duyet</note_>
    </sen:SecretarySetStateOperation>
  </soapenv:Body>
</soapenv:Envelope>