trunk/src/SendMessToDeanComApp/test/TeacherSetState/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sen="SendMessToDeanComApp">
  <soapenv:Body>
    <sen:TeacherSetStateOperation>
      <id_>5</id_>
      <state_>ok</state_>
      <note_>da xem</note_>
    </sen:TeacherSetStateOperation>
  </soapenv:Body>
</soapenv:Envelope>